In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["C1","C2","C3"])

In [3]:
df

         C1        C2        C3
A -0.679255 -0.753424  0.918825
B  0.213754 -0.690506  0.191501
C -0.571803  0.829032 -0.562712
D  0.093622  0.157905  0.991251

In [4]:
df > 0

      C1     C2     C3
A  False  False   True
B   True  False   True
C  False   True  False
D   True   True   True

In [5]:
b = df > 0

In [6]:
df[b]

         C1        C2        C3
A       NaN       NaN  0.918825
B  0.213754       NaN  0.191501
C       NaN  0.829032       NaN
D  0.093622  0.157905  0.991251

In [7]:
df[df>0]

         C1        C2        C3
A       NaN       NaN  0.918825
B  0.213754       NaN  0.191501
C       NaN  0.829032       NaN
D  0.093622  0.157905  0.991251

In [9]:
df["C1"] > 0

A    False
B     True
C    False
D     True
Name: C1, dtype: bool

In [10]:
df[df["C1"] > 0]

         C1        C2        C3
B  0.213754 -0.690506  0.191501
D  0.093622  0.157905  0.991251